{
    "cobblemon.species.turtwigpalms.name": "Arecan Turtwig",
    "cobblemon.species.turtwigpalms.desc1": "Turtwig that live in the Areca Region have adapted to live in the oceans alongside many other marine Pokémon. Its leaves are sensitive to currents underwater.",
    "cobblemon.species.grotlepalms.name": "Arecan Grotle",
    "cobblemon.species.grotlepalms.desc1": "The tree on Grotle's back is still young, leading many Grotle to spend their time sunbathing on the shore. Arecan Grotle have a weaker bite than Grotle from Sinnoh.",
    "cobblemon.species.torterrapalms.name": "Arecan Torterra",
    "cobblemon.species.torterrapalms.desc1": "Its tree may slow it down, but Arecan Torterra reign supreme in the ocean despite it. Every once in a while, there are sightings of Torterra with shells that are over 7.5 meters long.",
    "cobblemon.species.mankeypalms.name": "Arecan Mankey",
    "cobblemon.species.mankeypalms.desc1": "This unique variant of the species resembles a living coconut, prone to sudden fits of rage, thrashing unpredictably. Legend holds that its coconuts carry echoes of ancient storms, resonating with the ocean's fury when provoked.",
    "cobblemon.species.primeapepalms.name": "Arecan Primeape",
    "cobblemon.species.primeapepalms.desc1": "Fueled by ceaseless fury within its tough coconut shell, this relentless creature remains in a perpetual state of agitation, its hardened coconut hands ever-ready for action in the tropical wilderness.",
    "cobblemon.species.annihilapepalms.name": "Arecan Annihilape",
    "cobblemon.species.annihilapepalms.desc1": "In the heart of the tropical wilderness, a wrathful specter encased in a lifeless coconut unleashes boundless power when its seething anger reaches its peak.",
    "cobblemon.species.nosepasspalms.name": "Arecan Nosepass",
    "cobblemon.species.nosepasspalms.desc1": "Arecan Nosepass no longer point towards the north pole, as they now bare a nose made out of a gem similar to emeralds and rubies. In ancient times, they enjoyed roaming around small villages with an established economy.",
    "cobblemon.species.probopasspalms.name": "Arecan Probopass",
    "cobblemon.species.probopasspalms.desc1": "While it's gems are highly valued, it's floating mini heads watch all around itself. It is unknown how Arecan Probopass pierces it's nose rings despite not having hands."
}
